# Guide Enseignant : ScÃ©nario de DÃ©pannage - Exemple Complet

> âš ï¸ **DOCUMENT CONFIDENTIEL - RÃ‰SERVÃ‰ AUX ENSEIGNANTS**  
> Ce document prÃ©sente un exemple complet de scÃ©nario de dÃ©pannage avec storytelling, mÃ©thodologie et rÃ©paration.

---

## ğŸ”§ Comment Casser la Configuration (Pour l'Enseignant)

### PrÃ©paration Avant l'Exercice

**Ã‰tape 1 : Sauvegarder une Configuration Fonctionnelle**

Avant de casser quoi que ce soit, assurez-vous d'avoir une sauvegarde de la configuration qui fonctionne :

```cisco
Router# copy running-config tftp:
Address or name of remote host []? 192.168.10.10
Destination filename [router-confg]? R-Nova-backup.cfg
```

Ou sauvegardez localement :
```cisco
Router# copy running-config startup-config
```

**Important :** Notez les IPs, hostnames, et mots de passe utilisÃ©s pour pouvoir restaurer facilement.

---

### Comment Casser : Port Routeur DÃ©sactivÃ©

**MÃ©thode : DÃ©sactiver le port GigabitEthernet0/0**

**Commandes Ã  utiliser :**
```cisco
Router> enable
Router# configure terminal
Router(config)# interface gigabitEthernet0/0
Router(config-if)# shutdown    â† CETTE COMMANDE CASSE LA CONFIG
Router(config-if)# end
```

**Ce qui se passe :**
- Le port GigabitEthernet0/0 est dÃ©sactivÃ© manuellement
- L'interface passe de "up up" Ã  "administratively down down"
- Le routeur ne peut plus recevoir ni envoyer de paquets sur cette interface
- Le lien peut rester vert dans Packet Tracer (niveau physique), mais aucune communication n'est possible (niveau logique)

**VÃ©rification que c'est bien cassÃ© :**
```cisco
Router# show ip interface brief
```

**RÃ©sultat attendu :**
```
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         192.168.10.1   YES manual administratively down down
```

**Test depuis le PC :**
```
PC> ping 192.168.10.1
```
**RÃ©sultat attendu :** âŒ "Request timed out"

---

### âš ï¸ Points d'Attention

1. **Ne pas sauvegarder aprÃ¨s avoir cassÃ©** : Laissez la config cassÃ©e en RAM seulement, ou sauvegardez-la dans un fichier sÃ©parÃ© pour pouvoir la restaurer facilement.

2. **Tester avant de donner aux Ã©tudiants** : VÃ©rifiez que le problÃ¨me est bien reproduit et que la mÃ©thodologie fonctionne.

3. **Documenter** : Notez exactement ce qui a Ã©tÃ© modifiÃ© pour pouvoir guider les Ã©tudiants si nÃ©cessaire.

4. **PrÃ©parer la solution** : Ayez la commande de rÃ©paration prÃªte (`no shutdown`) pour pouvoir aider rapidement.

---

### ğŸ”„ Comment Restaurer Rapidement (Si Besoin)

**Option 1 : RÃ©parer manuellement**
```cisco
Router# configure terminal
Router(config)# interface gigabitEthernet0/0
Router(config-if)# no shutdown
Router(config-if)# end
```

**Option 2 : Restaurer depuis une sauvegarde**
```cisco
Router# copy tftp: startup-config
Address or name of remote host []? 192.168.10.10
Source filename []? R-Nova-backup.cfg
Router# reload
```

---

## ScÃ©nario : Le Routeur qui Ne RÃ©pond Pas

### ğŸ“– Histoire / Storytelling

**Contexte :**
Vous Ãªtes administrateur rÃ©seau chez NovaTech, une petite entreprise. Ce matin, un employÃ© du service informatique vous appelle en panique : "Rien ne fonctionne ! Les PC ne peuvent plus accÃ©der Ã  Internet, et mÃªme le serveur interne ne rÃ©pond plus !"

**La Situation :**
- Hier soir, tout fonctionnait parfaitement
- Ce matin, aucun PC ne peut communiquer avec le routeur
- Les liens sont verts dans Packet Tracer (donc les cÃ¢bles sont OK)
- Les IPs semblent correctes quand vous les vÃ©rifiez
- Mais le ping depuis n'importe quel PC vers le routeur Ã©choue complÃ¨tement

**Le MystÃ¨re :**
Vous savez que :
- Le routeur R-Nova a l'IP 192.168.10.1
- Le PC Tech-PC a l'IP 192.168.10.20
- Ils sont dans le mÃªme rÃ©seau (192.168.10.0/24)
- Les cÃ¢bles sont bien branchÃ©s (liens verts)
- Mais... rien ne fonctionne !

**Votre Mission :**
Trouver pourquoi le routeur ne rÃ©pond pas et le rÃ©parer avant que le patron n'arrive et que toute l'entreprise soit bloquÃ©e !

---

### ğŸ” MÃ©thodologie de DÃ©pannage

#### Ã‰tape 1 : Constater le SymptÃ´me PrÃ©cisÃ©ment

**Action Ã  faire :**
Depuis le PC Tech-PC, ouvrir le terminal et tester la connectivitÃ© :
```
PC> ping 192.168.10.1
```

**RÃ©sultat observÃ© :**
```
Pinging 192.168.10.1 with 32 bytes of data:

Request timed out.
Request timed out.
Request timed out.
Request timed out.

Ping statistics for 192.168.10.1:
    Packets: Sent = 4, Received = 0, Lost = 4 (100% loss)
```

**Observation :**
- âŒ Le ping Ã©choue complÃ¨tement
- Le routeur ne rÃ©pond pas du tout
- Le lien est vert dans Packet Tracer (donc pas de problÃ¨me de cÃ¢blage)

**Question Ã  se poser :**
"Pourquoi le routeur ne rÃ©pond-il pas alors que le lien est vert ?"

---

#### Ã‰tape 2 : VÃ©rifier la ConnectivitÃ© Physique

**Action Ã  faire :**
Inspection visuelle dans Packet Tracer

**VÃ©rifications :**
- [ ] Le lien entre le switch et le routeur est-il vert ? âœ… OUI
- [ ] Les cÃ¢bles sont-ils bien branchÃ©s ? âœ… OUI
- [ ] Les Ã©quipements sont-ils allumÃ©s ? âœ… OUI

**Conclusion :**
La connectivitÃ© physique est OK. Le problÃ¨me n'est pas au niveau du cÃ¢blage.

**Action suivante :**
Passer Ã  la vÃ©rification de la configuration rÃ©seau.

---

#### Ã‰tape 3 : VÃ©rifier l'Ã‰tat de l'Interface Routeur

**Action Ã  faire :**
Se connecter au routeur en console et vÃ©rifier l'Ã©tat des interfaces

**Commande Ã  utiliser :**
```cisco
Router> enable
Router# show ip interface brief
```

**RÃ©sultat observÃ© :**
```
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         192.168.10.1   YES manual administratively down down
GigabitEthernet0/1         unassigned      YES NVRAM  administratively down down
Vlan1                       unassigned      YES NVRAM  administratively down down
```

**ğŸ”´ PROBLÃˆME DÃ‰TECTÃ‰ !**

**Observation critique :**
- L'interface GigabitEthernet0/0 a bien l'IP 192.168.10.1 âœ…
- MAIS le Status est "administratively down" âŒ
- ET le Protocol est "down" âŒ

**Que signifie "administratively down" ?**
- Cela signifie que le port a Ã©tÃ© **dÃ©sactivÃ© manuellement** avec la commande `shutdown`
- Le port n'est pas cassÃ© physiquement, mais il a Ã©tÃ© "Ã©teint" par configuration
- C'est comme si vous aviez dÃ©branchÃ© le cÃ¢ble, mais en logiciel

**Diagnostic :**
Le port du routeur est dÃ©sactivÃ©. C'est pour Ã§a qu'il ne rÃ©pond pas, mÃªme si le lien est vert dans Packet Tracer (le lien est vert au niveau physique, mais le port est dÃ©sactivÃ© au niveau logiciel).

---

#### Ã‰tape 4 : VÃ©rifier la Configuration de l'Interface

**Action Ã  faire :**
VÃ©rifier la configuration complÃ¨te de l'interface pour confirmer le diagnostic

**Commande Ã  utiliser :**
```cisco
Router# show running-config interface gigabitEthernet0/0
```

**RÃ©sultat observÃ© :**
```
interface GigabitEthernet0/0
 ip address 192.168.10.1 255.255.255.0
 shutdown
 duplex auto
 speed auto
```

**ğŸ”´ CONFIRMATION DU PROBLÃˆME !**

**Observation :**
- La ligne `shutdown` est prÃ©sente dans la configuration
- C'est cette ligne qui dÃ©sactive le port

**Explication :**
Quelqu'un (peut-Ãªtre un collÃ¨gue qui testait, ou une erreur de manipulation) a tapÃ© `shutdown` sur cette interface. Le port est maintenant dÃ©sactivÃ©, donc aucune communication n'est possible, mÃªme si tout le reste est correct.

---

#### Ã‰tape 5 : Identifier la Cause Racine

**Questions Ã  se poser :**
- Pourquoi le port a-t-il Ã©tÃ© dÃ©sactivÃ© ?
- Quand cela s'est-il produit ?
- Qui a fait cette modification ?

**HypothÃ¨ses possibles :**
1. Un collÃ¨gue a testÃ© quelque chose hier soir et a oubliÃ© de rÃ©activer le port
2. Une erreur de frappe lors d'une configuration
3. Un script de maintenance qui a mal tournÃ©
4. Une sauvegarde/restauration qui a restaurÃ© une ancienne config avec le port dÃ©sactivÃ©

**Peu importe la cause** : L'important est de rÃ©parer maintenant !

---

### ğŸ”§ RÃ©paration

#### Solution : Activer le Port

**Action Ã  faire :**
Entrer en mode configuration de l'interface et activer le port

**Commandes Ã  utiliser :**
```cisco
Router# configure terminal
Router(config)# interface gigabitEthernet0/0
Router(config-if)# no shutdown
Router(config-if)# end
```

**Explication de chaque commande :**
- `configure terminal` : Entrer en mode configuration globale
- `interface gigabitEthernet0/0` : SÃ©lectionner l'interface concernÃ©e
- `no shutdown` : **Activer le port** (retirer la commande shutdown)
- `end` : Sortir du mode configuration

**Ce qui se passe :**
- La commande `no shutdown` retire la ligne `shutdown` de la configuration
- Le port passe de l'Ã©tat "administratively down" Ã  "up"
- Le routeur peut maintenant recevoir et envoyer des paquets

---

#### VÃ©rification ImmÃ©diate

**Action Ã  faire :**
VÃ©rifier que le port est maintenant actif

**Commande Ã  utiliser :**
```cisco
Router# show ip interface brief
```

**RÃ©sultat attendu :**
```
Interface                  IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0         192.168.10.1   YES manual up                    up
GigabitEthernet0/1         unassigned      YES NVRAM  administratively down down
Vlan1                       unassigned      YES NVRAM  administratively down down
```

**âœ… SUCCÃˆS !**

**Observation :**
- Le Status est maintenant "up" âœ…
- Le Protocol est maintenant "up" âœ…
- Le port est actif et opÃ©rationnel !

**Note :** Attendre quelques secondes pour que le lien se stabilise (il peut passer de orange Ã  vert).

---

#### Test Final de ConnectivitÃ©

**Action Ã  faire :**
Tester depuis le PC que tout fonctionne maintenant

**Depuis le PC :**
```
PC> ping 192.168.10.1
```

**RÃ©sultat attendu :**
```
Pinging 192.168.10.1 with 32 bytes of data:

Reply from 192.168.10.1: bytes=32 time=1ms TTL=64
Reply from 192.168.10.1: bytes=32 time=1ms TTL=64
Reply from 192.168.10.1: bytes=32 time=1ms TTL=64
Reply from 192.168.10.1: bytes=32 time=1ms TTL=64

Ping statistics for 192.168.10.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss)
```

**ğŸ‰ PROBLÃˆME RÃ‰SOLU !**

Le routeur rÃ©pond maintenant parfaitement. La connectivitÃ© est rÃ©tablie !

---

#### Sauvegarde de la Configuration

**âš ï¸ IMPORTANT : Ne pas oublier de sauvegarder !**

**Action Ã  faire :**
Sauvegarder la configuration pour qu'elle persiste aprÃ¨s redÃ©marrage

**Commande Ã  utiliser :**
```cisco
Router# copy running-config startup-config
```

**Ou en raccourci :**
```cisco
Router# wr
```

**Pourquoi c'est important :**
- Sans cette sauvegarde, si le routeur redÃ©marre, le port sera Ã  nouveau dÃ©sactivÃ©
- La commande `no shutdown` Ã©tait seulement en RAM (running-config)
- Il faut la sauvegarder en NVRAM (startup-config) pour qu'elle persiste

**VÃ©rification :**
```cisco
Router# show startup-config | include interface GigabitEthernet0/0
```

**RÃ©sultat attendu :**
```
interface GigabitEthernet0/0
 ip address 192.168.10.1 255.255.255.0
 duplex auto
 speed auto
```

**Observation :** Plus de ligne `shutdown` dans la startup-config âœ…

---

### ğŸ“‹ RÃ©sumÃ© de la MÃ©thodologie

**Checklist de dÃ©pannage utilisÃ©e :**

1. âœ… **Constater le symptÃ´me** : Ping Ã©choue
2. âœ… **VÃ©rifier la connectivitÃ© physique** : Liens verts OK
3. âœ… **VÃ©rifier l'Ã©tat des interfaces** : `show ip interface brief` â†’ "down down"
4. âœ… **VÃ©rifier la configuration** : `show running-config interface` â†’ ligne `shutdown`
5. âœ… **Diagnostiquer** : Port dÃ©sactivÃ© manuellement
6. âœ… **RÃ©parer** : `no shutdown`
7. âœ… **VÃ©rifier** : Interface "up up"
8. âœ… **Tester** : Ping fonctionne
9. âœ… **Sauvegarder** : `copy running-config startup-config`

---

### ğŸ’¡ Points ClÃ©s Ã  Retenir

**Pour les Ã©tudiants :**

1. **"administratively down"** = Port dÃ©sactivÃ© manuellement avec `shutdown`
   - DiffÃ©rent de "down" (problÃ¨me physique)
   - Solution : `no shutdown`

2. **Toujours vÃ©rifier l'Ã©tat des interfaces** avec `show ip interface brief`
   - C'est la premiÃ¨re chose Ã  faire quand le ping Ã©choue
   - MÃªme si les IPs semblent correctes

3. **Ne pas oublier de sauvegarder** aprÃ¨s chaque rÃ©paration
   - `copy running-config startup-config`
   - Sinon, la rÃ©paration sera perdue au redÃ©marrage

4. **MÃ©thodologie systÃ©matique** :
   - SymptÃ´me â†’ VÃ©rifications â†’ Diagnostic â†’ RÃ©paration â†’ Test â†’ Sauvegarde

---

### ğŸ“ Indices Ã  Donner aux Ã‰tudiants (si bloquÃ©s)

**Si l'Ã©tudiant ne trouve pas :**
- "Regardez l'Ã©tat de l'interface avec `show ip interface brief`"
- "Que signifie 'down down' ou 'administratively down' ?"
- "Quelle commande active un port ? (Pensez Ã  'no shutdown')"
- "MÃªme si le lien est vert, le port peut Ãªtre dÃ©sactivÃ© au niveau logiciel"

**Si l'Ã©tudiant trouve mais ne sait pas rÃ©parer :**
- "Comment retirer une commande dans Cisco ? (Utilisez 'no' devant la commande)"
- "Quelle commande retire 'shutdown' ? (`no shutdown`)"
- "N'oubliez pas de sauvegarder aprÃ¨s la rÃ©paration !"

---

### ğŸ“Š Tableau RÃ©capitulatif

| Ã‰tape | Action | Commande | RÃ©sultat Attendu |
|-------|--------|----------|------------------|
| 1 | Constater le symptÃ´me | `ping 192.168.10.1` | âŒ Timeout |
| 2 | VÃ©rifier physique | Inspection visuelle | âœ… Liens verts |
| 3 | VÃ©rifier Ã©tat interface | `show ip interface brief` | âŒ "down down" |
| 4 | VÃ©rifier config | `show running-config interface g0/0` | âŒ Ligne `shutdown` |
| 5 | RÃ©parer | `no shutdown` | âœ… Port activÃ© |
| 6 | VÃ©rifier | `show ip interface brief` | âœ… "up up" |
| 7 | Tester | `ping 192.168.10.1` | âœ… Reply |
| 8 | Sauvegarder | `copy run start` | âœ… Config sauvegardÃ©e |

---

*Ce scÃ©nario peut Ãªtre utilisÃ© comme modÃ¨le pour crÃ©er d'autres scÃ©narios de dÃ©pannage avec la mÃªme structure : Histoire â†’ MÃ©thodologie â†’ RÃ©paration.*
