# Guide Enseignant : Sc√©nario de D√©pannage SSH - Lab 2 Session 1

> ‚ö†Ô∏è **DOCUMENT CONFIDENTIEL - R√âSERV√â AUX ENSEIGNANTS**  
> Ce document pr√©sente un sc√©nario complet de d√©pannage SSH avec storytelling, m√©thodologie et r√©paration.

---

## üîß Comment Casser la Configuration SSH (Pour l'Enseignant)

### Pr√©paration Avant l'Exercice

**√âtape 1 : Sauvegarder une Configuration SSH Fonctionnelle**

Avant de casser quoi que ce soit, assurez-vous d'avoir une sauvegarde de la configuration SSH qui fonctionne :

```cisco
Router# copy running-config tftp:
Address or name of remote host []? 192.168.1.10
Destination filename [router-confg]? R-Sec-SSH-backup.cfg
```

Ou sauvegardez localement :
```cisco
Router# copy running-config startup-config
```

**Important :** Notez les IPs, hostnames, noms d'utilisateurs et mots de passe utilis√©s pour pouvoir restaurer facilement.

---

### Comment Casser : Lignes VTY Sans Authentification Locale

**M√©thode : Retirer `login local` des lignes VTY**

**Configuration normale (qui fonctionne) :**
```cisco
Router> enable
Router# configure terminal
Router(config)# line vty 0 4
Router(config-line)# login local
Router(config-line)# transport input ssh
Router(config-line)# end
```

**Commandes pour CASSER la configuration :**
```cisco
Router> enable
Router# configure terminal
Router(config)# line vty 0 4
Router(config-line)# no login local    ‚Üê CETTE COMMANDE CASSE LA CONFIG
Router(config-line)# end
```

**Ce qui se passe :**
- Les lignes VTY n'utilisent plus l'authentification locale (`login local`)
- Par d√©faut, Cisco peut permettre une connexion SSH mais sans authentification utilisateur appropri√©e
- Les utilisateurs locaux (admin, guest) peuvent se connecter mais **sans pouvoir passer en mode privil√©gi√©**
- La commande `enable` √©choue car l'authentification locale n'est pas configur√©e sur les lignes VTY
- L'utilisateur reste bloqu√© en mode utilisateur (`>`) m√™me s'il conna√Æt le mot de passe enable

**V√©rification que c'est bien cass√© :**
```cisco
Router# show running-config | section line vty
```

**R√©sultat attendu :**
```
line vty 0 4
 transport input ssh
 exec-timeout 1 0
```

**Observation :** ‚ùå La ligne `login local` est absente !

**Test depuis le PC :**
```
PC> ssh -l admin 192.168.1.1
Password: [saisir mot de passe admin]
Router> enable
Password: [saisir mot de passe enable]
% Access denied
```

**R√©sultat attendu :** 
- ‚úÖ La connexion SSH fonctionne (on arrive sur le routeur)
- ‚ùå Mais `enable` √©choue avec "Access denied" m√™me avec le bon mot de passe
- ‚ùå L'utilisateur reste bloqu√© en mode utilisateur (`>`)

---

### ‚ö†Ô∏è Points d'Attention

1. **Ne pas sauvegarder apr√®s avoir cass√©** : Laissez la config cass√©e en RAM seulement, ou sauvegardez-la dans un fichier s√©par√© pour pouvoir la restaurer facilement.

2. **Tester avant de donner aux √©tudiants** : V√©rifiez que le probl√®me est bien reproduit et que la m√©thodologie fonctionne.

3. **Documenter** : Notez exactement ce qui a √©t√© modifi√© pour pouvoir guider les √©tudiants si n√©cessaire.

4. **Pr√©parer la solution** : Ayez la commande de r√©paration pr√™te (`login local`) pour pouvoir aider rapidement.

---

### üîÑ Comment Restaurer Rapidement (Si Besoin)

**Option 1 : R√©parer manuellement**
```cisco
Router# configure terminal
Router(config)# line vty 0 4
Router(config-line)# login local
Router(config-line)# end
Router# copy running-config startup-config
```

**Option 2 : Restaurer depuis une sauvegarde**
```cisco
Router# copy tftp: startup-config
Address or name of remote host []? 192.168.1.10
Source filename []? R-Sec-SSH-backup.cfg
Router# reload
```

---

## Sc√©nario : SSH qui Ne Permet Plus l'Acc√®s Privil√©gi√©

### üìñ Histoire / Storytelling

**Contexte :**
Vous √™tes administrateur r√©seau chez NovaTech. Hier, vous avez configur√© SSH sur le routeur R-Sec pour permettre un acc√®s s√©curis√© √† distance. Tout fonctionnait parfaitement : vous pouviez vous connecter depuis votre PC avec les comptes `admin` et `guest`, et passer en mode privil√©gi√© avec `enable`.

**La Situation :**
- Ce matin, un coll√®gue vous appelle : "Je peux me connecter en SSH au routeur, mais je ne peux plus passer en mode privil√©gi√© !"
- Vous essayez depuis votre PC : `ssh -l admin 192.168.1.1`
- La connexion SSH fonctionne, vous arrivez sur le routeur
- Mais quand vous tapez `enable` et entrez le mot de passe, vous obtenez "Access denied"
- Vous √™tes bloqu√© en mode utilisateur (`>`) et ne pouvez rien modifier !
- Vous v√©rifiez : le routeur est bien allum√©, les c√¢bles sont branch√©s, les IPs sont correctes
- Le mot de passe enable est correct (vous l'avez test√© en console)
- Mais... vous ne pouvez pas passer en mode privil√©gi√© via SSH !

**Le Myst√®re :**
Vous savez que :
- Le routeur R-Sec a l'IP 192.168.1.1
- Le PC-Tech a l'IP 192.168.1.10
- Les utilisateurs `admin` et `guest` existent bien
- Les cl√©s RSA ont √©t√© g√©n√©r√©es hier
- Le mot de passe enable est correct (test√© en console)
- La connexion SSH fonctionne
- Mais... `enable` ne fonctionne plus via SSH !

**Votre Mission :**
Trouver pourquoi `enable` ne fonctionne plus via SSH et le r√©parer avant que toute l'√©quipe ne soit bloqu√©e !

---

### üîç M√©thodologie de D√©pannage

#### √âtape 1 : Constater le Sympt√¥me Pr√©cis√©ment

**Action √† faire :**
Depuis le PC-Tech, ouvrir le terminal et tester la connexion SSH :

```
PC> ssh -l admin 192.168.1.1
```

**R√©sultat observ√© :**
```
Connecting to 192.168.1.1...
Password: [saisir mot de passe admin]
Router> enable
Password: [saisir mot de passe enable]
% Access denied
Router>
```

**Observation :**
- ‚úÖ La connexion SSH fonctionne (on arrive sur le routeur)
- ‚úÖ L'authentification utilisateur fonctionne (on peut se connecter avec admin)
- ‚ùå Mais `enable` √©choue avec "Access denied"
- ‚ùå M√™me avec le bon mot de passe enable, on reste bloqu√© en mode utilisateur (`>`)

**Question √† se poser :**
"Pourquoi `enable` ne fonctionne-t-il plus via SSH alors qu'il fonctionnait hier ?"

---

#### √âtape 2 : V√©rifier la Connectivit√© R√©seau de Base

**Action √† faire :**
Avant de diagnostiquer SSH, v√©rifier que la connectivit√© r√©seau de base fonctionne.

**Test depuis le PC :**
```
PC> ping 192.168.1.1
```

**R√©sultat attendu :**
```
Pinging 192.168.1.1 with 32 bytes of data:

Reply from 192.168.1.1: bytes=32 time=1ms TTL=255
Reply from 192.168.1.1: bytes=32 time=1ms TTL=255
Reply from 192.168.1.1: bytes=32 time=1ms TTL=255
Reply from 192.168.1.1: bytes=32 time=1ms TTL=255

Ping statistics for 192.168.1.1:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss)
```

**Conclusion :**
‚úÖ Le ping fonctionne. Le probl√®me n'est pas au niveau de la connectivit√© r√©seau de base. Le routeur est accessible, mais `enable` ne fonctionne pas via SSH.

**Action suivante :**
Passer √† la v√©rification de la configuration SSH.

---

#### √âtape 3 : V√©rifier l'√âtat SSH sur le Routeur

**Action √† faire :**
Se connecter au routeur en console (acc√®s physique) et v√©rifier l'√©tat SSH.

**Commande √† utiliser :**
```cisco
Router> enable
Router# show ip ssh
```

**R√©sultat observ√© :**
```
SSH Enabled - version 2.0
Authentication timeout: 120 secs; Authentication retries: 3
```

**Observation :**
- ‚úÖ SSH est activ√© (version 2.0)
- ‚úÖ Les param√®tres SSH semblent corrects
- Mais `enable` √©choue quand m√™me via SSH...

**Action suivante :**
V√©rifier la configuration des lignes VTY.

---

#### √âtape 4 : V√©rifier la Configuration des Lignes VTY

**Action √† faire :**
V√©rifier la configuration compl√®te des lignes VTY pour voir comment l'authentification est configur√©e.

**Commande √† utiliser :**
```cisco
Router# show running-config | section line vty
```

**R√©sultat observ√© :**
```
line vty 0 4
 transport input ssh
 exec-timeout 1 0
```

**üî¥ PROBL√àME D√âTECT√â !**

**Observation critique :**
- ‚úÖ `transport input ssh` est pr√©sent (SSH est autoris√©)
- ‚ùå `login local` est **ABSENT** !
- ‚ùå Aucune m√©thode d'authentification n'est configur√©e sur les lignes VTY

**Que signifie l'absence de `login local` ?**
- Par d√©faut, sans `login local`, Cisco peut permettre une connexion SSH mais l'authentification pour `enable` ne fonctionne pas correctement
- Les utilisateurs locaux peuvent se connecter, mais ils ne peuvent pas utiliser leurs privil√®ges configur√©s
- La commande `enable` √©choue car l'authentification locale n'est pas activ√©e sur les lignes VTY
- M√™me si l'utilisateur `admin` a le privil√®ge 15, il ne peut pas passer en mode privil√©gi√© sans `login local`

**Diagnostic :**
Les lignes VTY ne sont pas configur√©es pour utiliser l'authentification locale. C'est pour √ßa que `enable` ne fonctionne plus via SSH, m√™me si la connexion SSH elle-m√™me fonctionne et que les utilisateurs existent.

---

#### √âtape 5 : V√©rifier que les Utilisateurs Locaux Existent

**Action √† faire :**
V√©rifier que les utilisateurs locaux sont bien cr√©√©s (pour confirmer que le probl√®me vient bien des lignes VTY).

**Commande √† utiliser :**
```cisco
Router# show running-config | include username
```

**R√©sultat observ√© :**
```
username admin privilege 15 secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m0
username guest privilege 1 secret 5 $1$mERr$hx5rVt7rPNoS4wqbXKX7m1
```

**Observation :**
- ‚úÖ Les utilisateurs `admin` et `guest` existent bien
- ‚úÖ Ils ont des mots de passe configur√©s (chiffr√©s)
- ‚úÖ Les niveaux de privil√®ge sont corrects (15 pour admin, 1 pour guest)

**Conclusion :**
Les utilisateurs existent et ont les bons privil√®ges. Le probl√®me vient bien de la configuration des lignes VTY qui ne permet pas √† `enable` de fonctionner correctement.

---

#### √âtape 6 : Tester `enable` en Console (Pour Comparer)

**Action √† faire :**
Pour confirmer que le probl√®me est sp√©cifique √† SSH, tester `enable` en console (acc√®s physique).

**Commande √† utiliser :**
```cisco
Router> enable
Password: [saisir mot de passe enable]
Router#
```

**R√©sultat observ√© :**
```
Router# 
```

**Observation :**
- ‚úÖ `enable` fonctionne parfaitement en console
- ‚úÖ Le mot de passe enable est correct
- ‚ùå Mais `enable` ne fonctionne pas via SSH

**Conclusion :**
Le probl√®me est sp√©cifique aux connexions SSH/VTY. La configuration des lignes VTY est incorrecte.

---

#### √âtape 7 : Identifier la Cause Racine

**Questions √† se poser :**
- Pourquoi `login local` a-t-il disparu ?
- Quand cela s'est-il produit ?
- Qui a pu modifier la configuration ?

**Hypoth√®ses possibles :**
1. Un coll√®gue a test√© quelque chose et a accidentellement retir√© `login local`
2. Une erreur de manipulation lors d'une modification de configuration
3. Une restauration partielle de configuration qui n'a pas inclus cette ligne

**Cause racine identifi√©e :**
La commande `login local` a √©t√© retir√©e des lignes VTY. Sans cette commande, m√™me si les utilisateurs locaux existent et peuvent se connecter, ils ne peuvent pas utiliser `enable` pour passer en mode privil√©gi√© via SSH.

---

#### √âtape 8 : Test Final Apr√®s R√©paration

**Action √† faire :**
Apr√®s la r√©paration, tester la connexion SSH et `enable` depuis le PC.

**Test depuis le PC :**
```
PC> ssh -l admin 192.168.1.1
Password: [saisir mot de passe admin]
Router> enable
Password: [saisir mot de passe enable]
Router#
```

**R√©sultat attendu :**
```
Router# 
```

**Observation :**
- ‚úÖ La connexion SSH fonctionne
- ‚úÖ L'authentification utilisateur fonctionne
- ‚úÖ `enable` fonctionne maintenant avec le mot de passe enable
- ‚úÖ On arrive en mode privil√©gi√© (`#`) comme pr√©vu

---

## üîß R√©paration

### √âtape 1 : Acc√©der au Mode Configuration des Lignes VTY

**Action √† faire :**
Se connecter au routeur en console et entrer en mode configuration des lignes VTY.

**Commandes √† utiliser :**
```cisco
Router> enable
Router# configure terminal
Router(config)# line vty 0 4
Router(config-line)# 
```

**Explication :**
- `enable` : Passer en mode privil√©gi√© (n√©cessaire pour modifier la configuration)
- `configure terminal` : Entrer en mode configuration globale
- `line vty 0 4` : Configurer les lignes VTY 0 √† 4 (les 5 lignes virtuelles)

---

### √âtape 2 : Ajouter l'Authentification Locale

**Action √† faire :**
Ajouter la commande `login local` pour activer l'authentification via les utilisateurs locaux.

**Commande √† utiliser :**
```cisco
Router(config-line)# login local
```

**Explication :**
- `login local` : Active l'authentification via les utilisateurs locaux cr√©√©s avec `username`
- Sans cette commande, les lignes VTY ne savent pas comment authentifier les utilisateurs pour `enable`
- Avec cette commande, les utilisateurs `admin` et `guest` peuvent se connecter via SSH ET utiliser `enable`

---

### √âtape 3 : V√©rifier la Configuration

**Action √† faire :**
V√©rifier que la configuration est correcte avant de quitter le mode configuration.

**Commande √† utiliser :**
```cisco
Router(config-line)# exit
Router(config)# show running-config | section line vty
```

**R√©sultat attendu :**
```
line vty 0 4
 login local
 transport input ssh
 exec-timeout 1 0
```

**Observation :**
- ‚úÖ `login local` est maintenant pr√©sent
- ‚úÖ `transport input ssh` est toujours l√†
- ‚úÖ La configuration est compl√®te

---

### √âtape 4 : Sauvegarder la Configuration

**Action √† faire :**
Sauvegarder la configuration pour qu'elle persiste apr√®s un red√©marrage.

**Commande √† utiliser :**
```cisco
Router# copy running-config startup-config
```

**R√©sultat attendu :**
```
Destination filename [startup-config]? 
Building configuration...
[OK]
```

**Explication :**
- Sans cette sauvegarde, la configuration serait perdue au red√©marrage
- La configuration est maintenant sauvegard√©e en NVRAM

---

### √âtape 5 : Tester la Connexion SSH

**Action √† faire :**
Tester la connexion SSH depuis le PC avec les deux comptes.

**Test 1 : Connexion avec admin**
```
PC> ssh -l admin 192.168.1.1
Password: [saisir le mot de passe admin]
Router> enable
Password: [saisir le mot de passe enable]
Router# 
```

**Test 2 : Connexion avec guest**
```
PC> ssh -l guest 192.168.1.1
Password: [saisir le mot de passe guest]
Router> enable
Password: [saisir le mot de passe enable]
Router# 
```

**V√©rifications :**
- ‚úÖ La connexion SSH fonctionne avec `admin`
- ‚úÖ La connexion SSH fonctionne avec `guest`
- ‚úÖ `enable` fonctionne maintenant avec les deux comptes
- ‚úÖ `admin` arrive en mode privil√©gi√© (`#`)
- ‚úÖ `guest` peut aussi utiliser `enable` (selon sa configuration de privil√®ge)

---

## üìã R√©sum√©

### Probl√®me Identifi√©
Les lignes VTY n'avaient pas la commande `login local`, emp√™chant l'utilisation de `enable` via SSH m√™me si la connexion SSH fonctionnait.

### Solution Appliqu√©e
Ajout de `login local` dans la configuration des lignes VTY.

### Commandes Cl√©s
- `show running-config | section line vty` : V√©rifier la configuration VTY
- `line vty 0 4` : Entrer en mode configuration VTY
- `login local` : Activer l'authentification locale (n√©cessaire pour `enable` via SSH)
- `copy running-config startup-config` : Sauvegarder

### Points Cl√©s √† Retenir
1. **SSH n√©cessite plusieurs √©l√©ments** : IP, cl√©s RSA, utilisateurs locaux, ET `login local` sur les lignes VTY
2. **`login local` est essentiel** : Sans cette commande, m√™me si la connexion SSH fonctionne, `enable` ne fonctionnera pas via SSH
3. **Sympt√¥me subtil** : La connexion SSH peut fonctionner, mais l'acc√®s privil√©gi√© est bloqu√©
4. **Tester compl√®tement** : Ne pas se contenter de v√©rifier que SSH fonctionne, tester aussi `enable`
5. **Toujours sauvegarder** : Apr√®s toute r√©paration, sauvegarder la configuration

---

## üéØ Indices pour les √âtudiants (Si Bloqu√©s)

### Indice 1 (Facile)
"Vous pouvez vous connecter en SSH, mais `enable` ne fonctionne pas. V√©rifiez la configuration des lignes VTY avec `show running-config | section line vty`. Que manque-t-il par rapport √† une configuration SSH normale ?"

### Indice 2 (Moyen)
"Les utilisateurs locaux existent, SSH fonctionne, mais `enable` √©choue via SSH. Regardez comment les lignes VTY sont configur√©es pour l'authentification. Comparez avec une connexion console o√π `enable` fonctionne."

### Indice 3 (Difficile)
"La commande `login local` permet aux lignes VTY d'utiliser les utilisateurs locaux pour l'authentification, y compris pour `enable`. Sans cette commande, m√™me si vous pouvez vous connecter, vous ne pourrez pas passer en mode privil√©gi√© via SSH. Cette commande est-elle pr√©sente dans votre configuration ?"

---

## üìä Tableau R√©capitulatif

| √âl√©ment | √âtat Initial (Cass√©) | √âtat Final (R√©par√©) |
|---------|----------------------|---------------------|
| **SSH activ√©** | ‚úÖ Oui | ‚úÖ Oui |
| **Cl√©s RSA g√©n√©r√©es** | ‚úÖ Oui | ‚úÖ Oui |
| **Utilisateurs locaux** | ‚úÖ Oui (admin, guest) | ‚úÖ Oui (admin, guest) |
| **`transport input ssh`** | ‚úÖ Pr√©sent | ‚úÖ Pr√©sent |
| **`login local`** | ‚ùå **ABSENT** | ‚úÖ **PR√âSENT** |
| **Connexion SSH** | ‚úÖ Fonctionne | ‚úÖ Fonctionne |
| **`enable` via SSH** | ‚ùå **√âCHOUE** | ‚úÖ **FONCTIONNE** |
| **Acc√®s mode privil√©gi√©** | ‚ùå Bloqu√© (`>`) | ‚úÖ Autoris√© (`#`) |

---

## üîÑ Variantes de Sc√©narios SSH (Pour Autres Exercices)

### Variante 1 : `transport input ssh` Manquant
**Sympt√¥me :** "Connection refused" ou Telnet fonctionne mais pas SSH  
**Cause :** Les lignes VTY autorisent Telnet par d√©faut, pas SSH  
**Solution :** Ajouter `transport input ssh` dans `line vty 0 4`

### Variante 2 : Cl√©s RSA Non G√©n√©r√©es
**Sympt√¥me :** "SSH server not responding"  
**Cause :** Les cl√©s RSA n'ont pas √©t√© g√©n√©r√©es  
**Solution :** `crypto key generate rsa` (minimum 1024 bits)

### Variante 3 : Nom de Domaine Manquant
**Sympt√¥me :** "Could not generate RSA keys" lors de la g√©n√©ration  
**Cause :** Le nom de domaine n'est pas d√©fini  
**Solution :** `ip domain-name novatech.local` avant de g√©n√©rer les cl√©s

### Variante 4 : Utilisateurs Locaux Non Cr√©√©s
**Sympt√¥me :** "Authentication failed" m√™me avec `login local`  
**Cause :** Aucun utilisateur local n'existe  
**Solution :** Cr√©er les utilisateurs avec `username admin privilege 15 secret [mdp]`

---

**Fin du Guide**
